#+BEGIN_COMMENT
.. title: Neo4j
.. slug: neo4j
.. date: 2021-03-17 15:27:09 UTC+01:00
.. tags: Data
.. category: 
.. link: 
.. description: 
.. type: text

#+END_COMMENT

So new project new life. The one before did not take off due to
bureaucratic issues - a pity.

Good is that on the new one I will work with Graph Databases. I love
graph structures and I deeply believe in them so I am very happy to
start this project.

This posts summarizes my learning encounters when working with graph
databases and sets some mental structure for working with them.

The notes are based on [[https://neo4j.com/books/neo4j-in-action-book/][Neo4j in action]].

#+begin_export html
<style>
img {
display: block;
margin-top: 60px;
margin-bottom: 60px;
margin-left: auto;
margin-right: auto;
width: 70%;
height: 100%;
class: center;
}

.container {
  position: relative;
  left: 15%;
  margin-top: 60px;
  margin-bottom: 60px;
  width: 70%;
  overflow: hidden;
  padding-top: 56.25%; /* 16:9 Aspect Ratio */
  display:block;
  overflow-y: hidden;
}

.responsive-iframe {
  position: absolute;
  top: 0;
  left: 0;
  bottom: 0;
  right: 0;
  width: 100%;
  height: 100%;
  border: none;
  display:block;
  overflow-y: hidden;
}
</style>
#+end_export

{{{TEASER_END}}}

* Neo4j Install on Kuberenetes

  So for the project we will work with a kubernetes cluster. So the
  next steps will be to install the Neo4j Community Edition on our
  cluster.

  While it is out of the box and straightforward to install Neo4j
  Enterprise Edition on it the community edition process seems to be
  more convoluted.

  Let's try to see by trial and error how long it will take to me.

  I also question if it makes sense to work with a helm chart
  directly as I will not be able to scale in either case with the
  community edition and you will generally probably not be able to use
  the benefit of kubernetes. Anyways let's leave the point open and
  let's try to install it. If it is quick it's fine. Then you are
  already on the platform so that post-PoC you will be able to
  quickly expand. Moreover like this you will be able to expand and
  refresh your skills on k8s. 

  So apparently it is possible to use the enterprise edition neo4j
  helm chart and change some parameters. Check [[https://community.neo4j.com/t/neo4j-community-edition-on-kubernetes/4955/4][this link]] in this
  sense.

  Note that the above is fine in the general sense i.e. some of these
  parameters I guess still hold and probably you can change the
  structure and achieve the same as mentioned there. The helm chart
  mentioned there is outdated in any case.

  The new chart is [[https://github.com/neo4j-contrib/neo4j-helm/][this]].

  So try to install it:

  #+BEGIN_SRC sh
   helm install neo-helm https://github.com/neo4j-contrib/neo4j-helm/releases/download/4.2.2-1/neo4j-4.2.2-1.tgz --set core.standalone=true --set acceptLicenseAgreement=yes --set neo4jPassword="MYPASSWORD" --namespace usz-sarcoma
  #+END_SRC

  Good, now you have =services= and =persitant volume= associated with
  it. Note that I installed the core.standalone mode where
  Replicasets are ignored and it acts as the community
  edition. I.e. it does not scale etc. Try to understand if with this
  you are fine or not.

  Ok so after installation I can see the various services running

  #+BEGIN_SRC sh :results raw
  kubectl get services --namespace usz-sarcoma
  #+END_SRC

  #+RESULTS:
  NAME                         TYPE        CLUSTER-IP   EXTERNAL-IP   PORT(S)                               AGE
  discovery-neo-helm-neo4j-0   ClusterIP   None         <none>        5000/TCP,6000/TCP,7000/TCP,3637/TCP   3h40m
  discovery-neo-helm-neo4j-1   ClusterIP   None         <none>        5000/TCP,6000/TCP,7000/TCP,3637/TCP   3h40m
  discovery-neo-helm-neo4j-2   ClusterIP   None         <none>        5000/TCP,6000/TCP,7000/TCP,3637/TCP   3h40m
  discovery-neo-helm-neo4j-3   ClusterIP   None         <none>        5000/TCP,6000/TCP,7000/TCP,3637/TCP   3h40m
  discovery-neo-helm-neo4j-4   ClusterIP   None         <none>        5000/TCP,6000/TCP,7000/TCP,3637/TCP   3h40m
  discovery-neo-helm-neo4j-5   ClusterIP   None         <none>        5000/TCP,6000/TCP,7000/TCP,3637/TCP   3h40m
  neo-helm-neo4j               ClusterIP   None         <none>        7474/TCP,7687/TCP,7473/TCP,6362/TCP   3h40m

  And you will have your persitant storage associated with the service
  as well

  #+BEGIN_SRC sh :results raw
  kubectl get pvc
  #+END_SRC

  #+RESULTS:
  NAME                            STATUS   VOLUME                                     CAPACITY   ACCESS MODES   STORAGECLASS      AGE
  datadir-neo-helm-neo4j-core-0   Bound    pvc-88a62e20-4905-4d51-bda4-f5b4e126e84a   20Gi       RWO            ibmc-block-gold   3h41m

  Good. Now you can also see your running pod that is running the
  services

  #+BEGIN_SRC sh :results raw
  kubectl get pods
  #+END_SRC

  #+RESULTS:
  NAME                    READY   STATUS    RESTARTS   AGE
  neo-helm-neo4j-core-0   1/1     Running   0          3h42m

  Well done. You must now expose the services to the outside world. I
  will start easily by testing it locally doing a port forward.

  #+BEGIN_SRC sh :results raw
  kctl port-forward neo-helm-neo4j-core-0 7474:7474 7687:7687 7473:7473 --namespace usz-sarcoma
  #+END_SRC

  Good. You can now access the neo4j webapp at =localhost:7474= and
  access the database from there via =localhost:7687=.

  You can start playing with it. Understand the visualization and the
  application schema through which you will communicate with the
  database. Then come back to expose the service to the outside world.

  
  
